<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"6c4eaf6aaca1303522bb868feb59a618d8646ff0f6e8ae3cb59bbf5bd5d9a3da","plan_job_ref":"Job .github/workflows/_test-tf.yaml #207 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11460858732","plan_out_hash":"618a7d2db30ec793832ae4247185747418ea514b0913d1db0943d1fb67b9780d","plan_hash":"d6f51c278c1468999ce060962912b6689618c7dd56fd90724307d213f5bf9aec","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #207](https://github.com/tx-pts-dai/github-workflows/actions/runs/11460858732)